Repository: atlas-studios/Session2-G2
Catalog: omegat/project_save.tmx
Source language: zh_cn
Languages: en_us

source: “哈哈哈哈哈……”站在阵法之外的血狐突然狂笑起来，冷冷的看了两人一眼，“哼，你们真以为，我会什么都没准备，就这么坐以待毙？”
en_us: "Ha ha ha ha ha…" The blood fox, who had been standing outside the array, suddenly laughed hysterically. Looking at the two of them coldly, he said, "Hey, did you really think that I did not make any preparations, that I would just sit and wait for death?"

source: “哈哈哈哈哈……”魔蛟笑得越发嚣张了起来，“白泽，就算你是神兽，也别想挡住我这水族大军。况且……”他话音一顿，阴冷的视线突然朝着沈萤和易峰的方向扫了过来，“你不是一向喜欢护着那些人类，不许兽族靠近陆地吗？不知今日你我一战之时，你是否还能分神护住这两个人修？”
en_us: "Hahaha..." The Wyrm Demon laughed arrogantly. "Bai Zhe, even if you're a Divine Beast, there's no way you can overcome my marine race army. Besides..." He paused for a moment, sweeping his gaze over to Shen Ying and Yi Feng. "Weren't you always protective of humans, refusing to let the beast tribes come close to land? I wonder if you can still protect these two cultivators when we start our battle?"

source: “哈哈哈哈哈哈……”魔修身上的黑气大盛，直接冲出了剑阵，手里拿着正是那面噬魂幡，“真是得来全不费功夫。”
en_us: "Hahaha…" The fiendish cultivator's black smoke grew in abundance and broke free of the sword array, his hand holding the Soul Devouring Gonfalon. "It was really a piece of cake to get this."

source: “哈哈哈哈哈，噬魂幡是我的了！”魔修越笑越大声，眼睛大睁，兴奋的看着四周森森的鬼气，“从此以后，化神之下无人将是我的敌手，万鬼驱使，我……噗！”他话还没说完，张嘴喷出一口血，形势突变。
en_us: "Hahaha, the Soul Devouring Gonfalon is mine!" The fiendish cultivator's laughter grew louder and his eyes opened wider. He excitedly looked at the eerie Ghost Qi surrounding him. "From now on, no one below the level of Soul Formation can stand up against me, millions of ghosts are at my beck and call, I… pfft!" Before he could finish what he was saying, he spat a mouthful of blood and the situation suddenly took a turn.

source: “哈哈哈哈，姑娘说得好。比起来人灵兽的确更讲义气，更可靠。”易峰好久没有遇到喜欢御兽的女修，而且对方貌似还是个隐藏很深的高阶修士，顿时起了结交的心思，“在下易峰，是易家家主，不知姑娘如何称呼？”
en_us: "Hahaha, well said, Lady. Compared to humans, spirit beasts are indeed much more loyal and reliable." It had been a long time since Yi Feng met a female cultivator who liked spirit beasts. Shen Ying also looked like a hidden expert. After a moment, Yi Feng decided that he wanted to get to know her better. "I'm Yi Feng, the Family Master of the Yi Family. May I know how to address you, Lady?"

source: “哈哈哈哈，果然是英雄出少年啊！”奚秋大笑出声，跟在坐的各堂主交换了一个眼神，众人皆是同样的想法。这样的人才，一定要不惜一切代价留下来。
en_us: "Hahaha, you really are an outstanding young man!" Xi Qiu laughed loudly, and exchanged looks with each of the Hall Masters in turn. Everyone had the same thought. Such a talent had to stay with them no matter what.

source: “哈哈哈哈，苍天有眼啊！老天爷，你终于开了一次眼了！”
en_us: "Hahahaha, the heavens have eyes! Heavenly father, you've finally come to help me for once!"

source: “哈哈哈！”
en_us: "Hahaha!"

source: “哈哈哈，宝贝呀，这真的是宝贝，老天有眼啊……”
en_us: "Hahaha, yeah! This is a treasure, a real one. The Heavens do favor me…"

source: “哈哈哈，成了？”
en_us: "Hahaha, does that count as a success?"

source: “哈哈哈，这魔音铃总算是我的了。”突然阵法中心的荆棘之上，出现了一个人，四五十岁的样子，一身黑衣，脸上都是黑色的条纹。正一脸兴奋的拿着刚刚年轻修士扔掉的那个盒子。
en_us: "Hahaha, this Fiend’s Bell is finally mine." Suddenly, out of nowhere appeared a person, looking about forty to fifty years old and dressed in full black with even his face covered in black stripes, standing on the thistles in the center of the array formation. He excitedly held onto the box that the young cultivator had dropped.

source: “哈哈！”
en_us: "Haha!"

source: “哈哈！怎么？还想动手？你打我啊！来啊，我绝不还手。”
en_us: "Ha ha! What, you want to fight? Strike me then! Come on, I promise I will not hit back."

source: “哈哈！江逸就你这实力，还想和我战？”
en_us: "Haha! Jiang Yi, with power like yours, you still think of sparring with me?"

source: “哈哈，听雨小姐，你实力冠绝全雄，都已经是铸鼎境八重了，这群陪练哪是你的对手？要不在下陪你战一场？”
en_us: "Haha, Miss Tingyu, your power is top-class and a head above the rest. With your power level already at the eighth stage of the Cast Tripod Realm,which sparring partner here could ever be a worthy opponent? How about I join you for a match?"

source: “哈哈，地阶丹药？这一炉灵神丹竟然炼出地阶丹药？这其中莫非有什么玄妙不成？不行我得好好研究研究……”
en_us: "Haha, Earth-tier elixirs? This cauldron of Spirit Pills could actually refine Earth-tier elixirs? Could there perhaps be something mysterious behind it? No, I have to carefully examine and research this..."

source: “哈哈，我还以为是谁？江逸，又是你这个废物？”
en_us: “Hah! And I was just wondering who it was! It’s just Jiang Yi, the good-for-nothing boy!”

source: “哈？”啥意思？
en_us: "Huh?" What did she mean?

source: “哈？”她直接傻掉，这什么节奏，收徒？想跟她学什么？宅丧废吗？
en_us: "Huh?" She was immediately dumbfounded. What's happening? What disciple? What did he hope to learn from her? To be a total lazy shut-in?

source: “哎呀！”
en_us: "Oh no!"

source: “哎呀，断了！”沈萤一脸意外的扔开手里长长的尾狐，“也没用力的说。”
en_us: "Oh man, it broke off!" Shen Ying appeared surprised as she tossed away the long fox tails in her hands. "I didn't use much strength.”

source: “哎哟……”
en_us: "Ouch!"

source: “哎哟！”
en_us: "Ouch!"

source: “哗！”
en_us: "Wow! "

source: “哟……”她上前一步，正要叫人。
en_us: "Hey..." She stepped forwards and was about to call him.

source: “哟，你好啊！”沈萤走近几步，“请问，有看到我家厨子吗？他叫什么……清，长得挺帅的那个！”
en_us: "Hey, how are you!" Shen Ying walked toward him. "May I ask if you've seen my sect's chef? He's called... Something... Qing. He looks quite handsome!"

source: “哟，你好！”
en_us: "Hey, hello!"

source: “哟，兔子你来了。”没等羿清搞明白怎么回事，沈萤洗完手，往她那件灰袍子上抹了两把，走了过来，“来得挺早啊。”
en_us: "Hey, Rabbit you are here." Yi Qing had yet to have a single clue as to what was going on, when Shen Ying walked over after having washed her hands, drying them on that grey robe of hers as she said, "You are pretty early."

source: “哟，兔子，好久不见！”
en_us: "Hey, Rabbit. Long time no see!"

source: “哟，原来还活着啊！”她突然就叹了口气。
en_us: “Oh, so you are still alive!" she said with a deep sigh.

source: “哟，厨子。”沈萤扬手打了个招呼。
en_us: "Hey, Chef," Shen Ying waved.

source: “哟，变长了。”沈萤有些惊讶的睁大眼睛。
en_us: "Oh, it's become long," Shen Ying's eyes widened.

source: “哟，小绿妹子啊。”
en_us: "Hey, Sister Little Green."

source: “哟，搞定了。”刚回来的沈萤推了推旁边的人，突然开口。
en_us: "Hey, it's done." Shen Ying who had just came back suddenly spoke and nudged the person beside her.

source: “哟，早上好，你们……”她话一顿歪了歪头，“谁啊？”
en_us: "Oh, good morning. You…" Pausing in mid-speech, she asked, "Who are you?"

source: “哟，牛爸爸。”沈萤朝他招了招粘满了油渍的手，习惯性的让出了点位置，“吃午饭了，要一起吗？”她指了指正在感肉的羿清，对方回了孤月一个嫌弃的眼神——不要脸，还来偷师！
en_us: "Hey, Father Niu!" Shen Ying waved her greasy hands at him and made space for him out of habit. "It's lunch time, do you want to join us?" She pointed toward Yi Qing who was still roasting meat. Yi Qing shot Lonemoon a dirty look. How shameless — you still want to steal my master!

source: “哟，醒了！”一炸毛更圆更像毛团了。
en_us: "Hey, you're awake!" The beast's fur bunched up, making it like a huge furball.

source: “哦~~~~”*2
en_us: "Oh…" *2

source: “哦……”
en_us: "Oh…"

source: “哦……”不就是取名字吗？她很擅长的，“朗朗上口那就：碧粳、松糕、酥酪、鱼盏……”
en_us: "Oh…" Isn't it just a name? "Catchy and pleasing to the ears. Bijing[1. A type of grain], Sponge Cake, Cheese, Fish…"

source: “哦……”原来是做为广告部出去宣传的。
en_us: "Oh…" So it's about going there as the marketing department to advertise.

source: “哦……”原来这世界真的有神仙啊，有意思。
en_us: "Oh…" So this world really does have immortals, interesting.

source: “哦……”原来那个抖M，“你父亲咋了？”
en_us: "Oh..." So it was that asshole. "Is your father alright?"

source: “哦……”她歪头呆了呆，“那是不是都长在肚子上的？”
en_us: "Oh…" She tilted her head as she fell into a momentarily daze. "Do they all grow in the stomach?"

source: “哦……”她点了点头，难怪刚这只小动物不说人话，“那能吃吗？”
en_us: "Oh…" She nodded. No wonder this little animal didn't speak human language just now. "Can it be eaten?"

source: “哦……”她顿时想起了白天某个被揍得直抽抽的身影，同情看了一眼某人还未恢复的脸，“现在的年轻人，口味挺重啊！”打一顿居然也能看对眼了？！
en_us: "Oh…" A sudden image of a figure bashed up so badly that it was shaking uncontrollably came to Shen Ying's mind. She looked sympathetically at the person whose face had yet to recover. "Today's youngsters have strong tastes!" Love at first bash?

source: “哦……”对方一脸状况外，愣愣的唤出飞剑，飞了起来。
en_us: "Oh…" The other party looked a little confused. She summoned her flying sword in a daze before she started to fly.

source: “哦……”强行征用吗？“历练要多久？”
en_us: "Oh…" Forcibly recruited? "How long is this experiential training expedition?"

source: “哦……”懂了。也就是说怪刷了，装备没摸。
en_us: "Oh..." She understood now. She had killed the beast but she hadn't looted its possessions.

source: “哦……”搞半天还是个素菜。
en_us: "Oh..." All this fuss over a vegetable.

source: “哦……”沈萤一脸兴趣缺缺的样子，“可以不去吗？”
en_us: "Oh…" Shen Ying's interest was dwindling. "Can we not go?"

source: “哦……”沈萤仍是一脸无所谓的样子，“要不扔了。”
en_us: :Oh..." Shen Ying still looked unbothered. "Let's throw it away then."

source: “哦……”沈萤到是一点都不在意，拍了拍魔王的肩道，“我相信你！”
en_us: "Oh..." Shen Ying wasn't bothered the least bit, and patted the Devil King on his shoulder. "I believe you!"

source: “哦……”沈萤夹起碟子上的糕点，凑近他的小脸道，“这是核桃酥。”
en_us: "Oh... this is walnut cake." Shen Ying said as she went closer to Ning ZiAn and picked up the pastry on the plate.

source: “哦……”沈萤晃然，“那个抢萝卜的素菜家族啊。”
en_us: "Oh…" Suddenly recalling them, Shen Ying exclaimed, "That vegetable family who tried to snatch the radish."

source: “哦……”沈萤点了点头，“写了些啥？”
en_us: "Oh…" Shen Ying nodded. "What's written in it?"

source: “哦……”沈萤点了点头，“啥叫灵气？”
en_us: "Oh..." Shen Ying nodded. "What's Spirit Qi?"

source: “哦……”沈萤点了点头，也就是说他现在是多了一个分身，一死死两？这个世界的设定好麻烦啊，“那有其它办法吗？”
en_us: ”Oh..." Shen Ying nodded his head. This means that there's another duplicate of him now. If one dies, the other perishes as well. The way this world works... It's so annoying. “Is there any other way around it?"

source: “哦……”沈萤点了点头，看了地上魔蛟一眼，“原来魔族这么没用的吗？”连宠物都做不了。
en_us: "Oh..." Shen Ying nodded. She looked at the demonic wyrm, "So demonic beasts are useless?" They can't even be adopted as pets.

source: “哦……”沈萤点了点头，细一看牛爸爸，他已经闭上了眼睛，看来的确陷入了心魔之中。只不过不到五分钟的时间，又再次张开。很明显他渡过了心魔。
en_us: "Oh..." Shen Ying nodded and looked carefully at the Father Niu. He had closed his eyes and seemed to be caught up with his mental demons. In less than five minutes he opened his eyes again. Obviously he had overcome his mental demons.

source: “哦……”沈萤点点头，完全没听懂的说，“你到底想说啥？”
en_us: "Oh… " Shen Ying nodded, totally not understanding a word he said. She then asked, "What exactly are you trying to say?"

source: “哦……”沈萤皱了皱眉，也没有多想，就着雷光又抓了把瓜子，继续嗑。
en_us: "Oh..." said Shen Ying frowning. Leaving her thoughts aside, she grabbed another bunch of melon seeds as another bolt of lightning struck and continued munching.

source: “哦……”沈萤眉头拧了起来，“真的要走？”
en_us: "Oh..." Furrowing her brows, Shen Ying asked, "You're really going?"

source: “哦……”没懂。
en_us: "Oh..." Still does not get it.

source: “哦……”那个抖M，原来是感情问题啊，“咋了，不喜欢？”自从那天宴席后，那个叫印元飞的就天天来找人，变着花的找理由约人家出去，什么送定金啦，定金送少了啦，改主意想预付全款啦……
en_us: "Oh..." that masochist. So this was a relationship problem. "What's wrong, you don't like him?" Since the banquet, Yin Yuanfei had been coming up to their sect every single day to look for Si Yu and giving rotten excuses to take her out. First, he wanted to send the deposit. Then, he said he gave too little deposit. Then, he wanted to pay the full sum...

source: “哦……什么？！”孤月一惊，就连薄飞平也立马看了过来，震惊的看向她，“你看到啥了？”
en_us: Shocked, Lonemoon exclaimed, "OH! What?!" Even Pu Feiping came over immediately and asked in astonishment, "What did you see?"

source: “哦……记住了。”
en_us: "Ok... I'll remember."

source: “哦。”
en_us: "Oh."

source: “哦。”也就是说，需要挂个牌，不然就是魔修黑户？“那我们自己成立一个呗。”
en_us: "Oh." In other words, we have to hang tags around our necks or we’ll look like fiendish cultivators? "Then let's just establish one on our own."

source: “哦。”兔王一愣，这才明白她的意思，“没事的，他们早已经会化形了，只是习惯了兔身而已。”
en_us: "Oh," the Rabbit Monarch was stupefied, but then finally understood what she meant and replied, "It's alright, they already know how to make use of manifestation but are just accustomed to the rabbit form."

source: “哦。”原来传承就是本生活技能大全。
en_us: "Oh." So the heritage was just a compilation of life techniques.

source: “哦。”原来如此，她了然的点了点头。没有再问，转头瞅了瞅眼前的一片狼藉，转移话题道，“园长，我们接下来去哪？”
en_us: "Oh," so that's the reason. She nodded and stopped asking questions. She turned to study the mess in front of them and changed the topic, "Leader, where are we headed next?"

source: “哦。”吃得差不多的沈萤拍了拍手也站了起来，“那谁……谢谢啊，再见！”
en_us: "Oh." Shen Ying had eaten her fill. She dusted off her hands and got to her feet, "That whoever... Thank you. Goodbye!"

source: “哦。”吃饱喂足正趴在桌上不想动的人，懒懒的应了一声。
en_us: "Oh," lazily responded the person laying on the table, having eaten her fill.

source: “哦。”女子呆了呆，突然朝它一点头，“恭喜啊！”
en_us: "Oh." The woman fell into a momentary daze before nodding at it. "Congratulations!"

source: “哦。”她一脸认真的指了指塔顶，“那为什么不直接从外面飞上去呢？”
en_us: "Oh." With an earnest expression, Shen Ying pointed to the pagoda and asked, "Then why don't they fly directly up to the pagoda from outside?"

source: “哦。”她点了点头。
en_us: "Oh," she nodded.

source: “哦。”她点了点头，眼里没有任何波澜的问了一句，“那这样的还有吗？”
en_us: "Oh." Shen Ying nodded. With an innocent look look, she asked, " Are there any others?"

source: “哦。”她端起糕点就打算撤。
en_us: "Oh," she picked up the plate of pastries and prepared to leave.

source: “哦。”早说啊！
en_us: "Oh." Could have just said that earlier!

source: “哦。”果然是犬瘟吧？
en_us: "Oh." It’s a dog after all.

source: “哦。”某人弱弱的退回了印风背后。
en_us: "OK." A certain someone meekly went back and stood behind Yin Feng.

source: “哦。”根本不知道他说啥的沈萤，只能猜到他是不想吃的意思，于是收回筐，“那再见！”说着就想转身进屋。
en_us: "Oh." Shen Ying had no idea what he was saying but could only guess that he meant he did not want to eat. "In that case, goodbye!" she said, keeping the basket, then turned towards the house.

source: “哦。”沈萤一愣，直接转头看向兔子加了句，“那兔子，我要没妖气的地。”
en_us: "Oh." Shen Ying pondered for a while, then turned her head and looked at the rabbit, adding, "Then in that case, Rabbit, I want a place with no demonic aura."

source: “哦。”沈萤一脸失望。
en_us: "Oh." Shen Ying was clearly disappointed.

source: “哦。”沈萤也没在意，晃了晃特别酸痛的左手，却发现四周的竹林已经倒了大半，光秃秃的枝干，连叶子都见不到几片。昨天刮大风了吗？吹得这么厉害。她往前走了两步，却看到前方有一个硕大的坑，像是被什么砸出来一样。嗯……这的风景真有意思！
en_us: "Oh." Unconcerned, Shen Ying started shaking her particularly sore left hand. She then realized that half of the surrounding bamboo forest had been toppled down, and most of their branches were bare except for a few leaves. Were there strong winds yesterday? Must have been some powerful wind. She walked two paces, and saw a huge hole in front of her, as if the ground had been smashed hard by something. Well… The scenery was really interesting.

source: “哦。”沈萤又看了一眼，没见过的小动物，不知道能吃不？
en_us: "Oh." Shen Ying looked at it again. I’ve never seen this little creature before. Wonder if it can be eaten?

source: “哦。”沈萤抓了抓头，伸了个懒腰，走到了那堆食材前，顺手拿起一根，皱了皱眉，“怎么又是萝卜？唉……果然是群兔子啊，昨天是红萝卜，今天是白萝卜，卧槽！还有青萝卜。明天不会送紫的吧？”
en_us: "Oh." Shen Ying scratched her head and stretched her lazy bones. She walked to the pile of ingredients and conveniently picked up a piece. Her brows furrowed as she said, "Why is it carrots again? Sigh… They are indeed a bunch of rabbits. Yesterday it was red turnips, today it is white radish. Holy shit! There's also green turnip. Don't tell me they are giving me purple ones tomorrow?"

source: “哦。”沈萤收回了脚，不踢就不踢，她还懒得动呢。
en_us: "Oh." Shen Ying retracted her foot. It was better that she did not need to kick it as she was too lazy to move anyway.

source: “哦。”沈萤有些不开心的点了点头，“你们家人？”
en_us: "Oh," Shen Ying nodded unhappily. "Is he from your family?"

source: “哦。”沈萤点了点头，“那为什么都不进去呢？”
en_us: "Oh." Nodding her head, Shen Ying asked, "Then why don't they enter?"

source: “哦。”沈萤点了点头，“那都解决了吗？”
en_us: "Oh." Shen Ying nodded her head and asked, "So is it all settled?"

source: “哦。”沈萤点了点头，接着道，“那他不能暴露什么身份？”
en_us: "Oh," Shen Ying nodded, "then what identity does he have to hide?"

source: “哦。”沈萤点头，总的来说，这就是一分省时省力的短时工，不过……啥叫‘住鸡’？
en_us: "Oh." Shen Ying nodded. In conclusion, this was a short job that would save time and energy, but… what did 'Zhu Ji' mean[2. Zhu Ji is a homophone to Foundation Establishment. This becomes a joke as she did not understand what the disciple was talking about as she had no knowledge of the different cultivations.]?

source: “哦。”沈萤直接解释道，“这是园长和毛团。”
en_us: "Oh," Shen Ying began to explain, "this is Director and Furball."

source: “哦。”沈萤这才出声，喊了一句，“小绿！别打了。”
en_us: "Oh." Shen Ying finally spoke up, shouting, "Little Green! Stop hitting him."

source: “哦。”沈萤随手拔出了地上的一把剑。
en_us: "Oh." Shen Ying conveniently grabbed a sword from the ground.

source: “哦。”沈萤顺势坐在他扒出的椅子上，“这啥塔，有什么用？”
en_us: "Oh," Shen Ying sat on the chair that Feng Ying dusted. "What kind of pagoda is that? What is it for?"

source: “哦。”没关系就好，沈萤顿时没了兴趣，转头朝着厨房道，“厨子，菜好了吗？”
en_us: "Oh." Good that it was nothing. Shen Ying lost interest in the novel and turned toward the kitchen, "Chef, is the food ready?"

source: “哦。”虽然没听太懂，但应该是说这里有条近路。
en_us: "Oh." Although she did not exactly understand, his words should mean that there was a short cut.

source: “哦你个头，快走啦！”
en_us: "Oh my ass. Let's leave quickly!"

source: “哦哦。”
en_us: "Oh okay."

source: “哦哦！少爷好厉害，少爷加油哦。”心思单纯的江小奴立即不再多问，小鸡啄米的点头，大眼睛眯成月牙儿，都是崇拜之色。
en_us: "Oh! Oh! Young Master is so powerful! You can do it, Young Master!" The simple and pure-of-heart Jiang Xiaonu quickly stopped asking questions. She merely nodded her head rapidly and her eyes grew to twin moons. It was clear that she looked up to him.

source: “哦对了，忘了说。我顿悟后不知道什么时候会醒，所以那是无敌派未来两个月的生活费。”
en_us: "Oh, I almost forgot. I don't know how long it takes to wake up from my epiphany, so those are two months living expenses for Invincible Sect."

source: “哦！”
en_us: "Oh, okay!"

source: “哦！”她手一松，扔了。
en_us: "Oh!" She released the animal's hoof and let it fall to the ground.

source: “哦，不要。”
en_us: "Oh, I don't want it."

source: “哦，也就是说……这是个副本！”
en_us: "Oh, that means... this is only a copy!"

source: “哦，今天做个汤吧，饿太久，要温温胃。”
en_us: "Oh, please make soup today. I have been hungry for too long, I need to warm my belly."

source: “哦，他们是化神剑修。”
en_us: "Oh, they are Soul Formation sword cultivators."

source: “哦，他死得不冤，戚……戚，烤鸡妹子。”
en_us: "Oh, he did not die a pointless death. Qi… Qi… Roasted Chicken Gal."

source: “哦，他被我用咸鱼拍进来的。”
en_us: “Oh, I slapped him in with salted fish." ”

source: “哦，他说他在这里等了几万年。”沈萤随口解释道，“死活要塞什么传承给我，结果没塞成功。”
en_us: "Oh, he says he's been waiting here for tens of thousands of years," Shen Ying explained matter-of-factly. "He insists on handing his heritage down to me, but he's not succeeding.”

source: “哦，你们仙乡的人，有缘起来这么随便的吗？”刚刚他好像也这么说。
en_us: "Oh, you people of the immortal town… Is it that easy to have fate?" That was exactly what the immortal soul had told Qing Lan earlier.

source: “哦，你会做饭吗？”
en_us: “Erh, can you cook?"

source: “哦，原来你认识这阵法。”狐妖有些意外的看了他一眼，眼神却更狠了，“没错这的确是上古阵法，但是什么我之前也不知道，不过只要能制住你们就行。”
en_us: "Oh, you know this formation." The fox demon looked at him, slightly surprised, but then the light in his eyes turned more vicious. "Yes, this is indeed an ancient array formation, but as to what it was exactly I too had no idea. But it doesn't matter as long as it can hold the two of you down."

source: “哦，原来是他！”
en_us: "Oh, it's them!"

source: “哦，原来是那个毛团！”沈萤眼睛睁大了点，带些小惊的看向空中的白色巨兽。
en_us: "Oh, it's that white furball!" exclaimed Shen Ying as she gawked at the great white beast in the sky.

source: “哦，好麻烦啊。”比赛后她只想回家睡觉的说。
en_us: "Oh, that's so troublesome." She had been planning to go home and take a nap immediately after the competition..

source: “哦，好！”她用力的点了点头，“加油！”
en_us: "Oh, okay!" She nodded. "All the best!"

source: “哦，我只是有点小问题。”
en_us: "Oh, I just have a small problem."

source: “哦，我叫它们来帮个忙。”沈萤指向后面的小茅屋，“我这屋子，那天不是被劈了大半吗？我又不会修，好在这几天没下雨，勉强凑合了一下。兔子说它会，所以我就叫它来帮忙修房子了。”
en_us: "Oh, I asked them to come and help out." Shen Ying pointed to the straw cottage at the back and continued, "Wasn't my house torn apart that day? I didn’t know how to fix it, but luckily it did not rain these past few days so I barely managed to make do with it. The rabbit said that it knew how to fix it, which is why I got it to help fix my house."

source: “哦，我叫沈萤。”
en_us: "Oh, my name is Shen Ying."

source: “哦，我找不到传送阵，走着走着就到这里了。”沈萤老实回答，“对了，这只是什么兽？看起来很好吃的样子，你们卖吗？”
en_us: "Oh, I couldn't find the transportation array so I walked around and ended up here," Shen Ying answered honestly. "That's right, what beast is this? It looks really delicious. Are you selling it?"

source: “哦，我知道了，你飘过来一下！”
en_us: "Oh, I got it. Float over here for a moment!"

source: “哦，我跟上仙约好这个时辰来的。”妖王呵呵笑着解释，越加献媚，态度都快低到坑里去了，“上仙有事吗？没关系，我们等等就好。”
en_us: "Oh, I have a date with the Exalted Immortal at this time," the Demon Monarch explained while laughing, sounding even more sycophantic and almost subservient. "Is the Exalted Immortal busy? It's alright, we can totally wait."

source: “哦，我跟他们掌门说，刚刚一路追着魔修到这里就不见了，怀疑太虚派里混进了魔修的奸细。”孤月一本正经的道，“他们现在忙着集合弟子找卧底呢，所以暂时不会有人来悟剑峰。趁着山下没人，一会我们再溜出去。”
en_us: "Oh, I told their sect master that we lost the fiendish cultivator here, and suspect there is a fiendish cultivator mole in the Grand Vacuity Sect." Lonemoon spoke seriously, "They are now busy gathering the disciples to look for that spy, so no one will come to Sword Comprehension Peak for the time being. Let's take this opportunity to escape."

source: “哦，打劫的！”沈萤随口解释了一句。
en_us: "Oh, they came to rob us!" Shen Ying replied matter-of-factly.

source: “哦，是临时，呃……一个老乡给的。”临时厨子跟她显摆时，忘了拿回去的。
en_us: "Oh, it was given to me by, erh… a fellow from my hometown." The temporary chef had forgotten to take the token back after showing it off to her.

source: “哦，江逸！”柳长老点了点头，一挥手道：“你立即去准备二十钱茯苓，三十钱白矾，十五钱车前草，四十钱……老夫立即要炼丹，今日一定要炼制出地阶丹药！”
en_us: "Oh, Jiang Yi! " Elder Liu nodded his head and waved his hand and instructed, "You go prepare these immediately: one hundred grams of china root, one hundred and fifty grams of alum, seventy-five grams of plantago seed, two hundred grams of ... I want to start refining elixirs immediately! I must successfully refine some earth-grade elixirs today!"

source: “哦，没关系。”沈萤扫了他一眼，下意识的伸手落在他头上，想了想又加了一句，“放心，作业没完成，不扣你分。”
en_us: "Oh, don't worry." Shen Ying scanned him, subconsciously placing her hand on his head. After pausing for a moment, she continued, "Don't worry. The assignment isn't completed, I won't deduct your marks."

source: “哦，然后呢……”沈萤仍是一脸的无所谓。
en_us: "Oh, then..." Shen Ying still appeared nonchalant.

source: “哦，羿清啊。我们赶紧上路，送他回去吧。”
en_us: "Oh, Yi Qing. Let's hit the road and escort him back."

source: “哦，谢了。”
en_us: "Oh, thanks."

source: “哦，谢谢啊。”
en_us: "Ok, thanks."

source: “哦，谢谢！”对方点了点头，回了她一个笑容，顺着指的方向走远了。
en_us: "Oh, thank you!" Shen Ying nodded with a smile, before walking away in that direction.

source: “哦，辛苦了。”她拎起一块肉，立马奔向后面的厨房，啃了几天的萝卜，终于有肉吃了，还是家猪肉。她脑海里顿时浮现出一道道肉菜，辣椒炒肉，红烧肉，水煮肉……想想就流口水。
en_us: "Oh, that's hard on you." She picked up a piece of meat and ran straight to the kitchen at the back. After having munched on carrots for a few days, there was finally meat to eat, and more specifically there was pork. The images of different pork dishes flashed across her mind — spicy pork stir-fry, braised pork in brown sauce, boiled pork… The mere thought of them already had her salivating.

source: “哦，辛苦了！”
en_us: "Oh, thank you for your hard work!"

source: “哦，还有一个呢？”
en_us: "Oh, how about the last one?"

source: “哦，这么猖狂？”孤月皱了皱眉，示意他继续说。
en_us: "Oh, it’s that bold?" Lonemoon frowned, motioning him to continue.

source: “哦，这回不算。”她突然想起了什么，指了指满地的妖尸又补充，“我就住在附近那个茅屋里，你们大晚上的不睡觉，在这里嗷嗷嗷个不停，把我给吵醒了。你知道的……谁还没个起床气，就过来瞅了瞅。”
en_us: "Oh, it’s different this time." The woman suddenly recalled something as she pointed to the demon carcasses on the ground and clarified, "I live in a straw cottage nearby. The lot of you were still making a din despite it being so late; thus, waking me up. And you know… who doesn't have a morning temper? That's why I came over to take a look."

source: “哦，这是我以前抓那些动物时发现的，我看它会发光，就带回来了。”沈萤随口解释，“我这没灯，所以想拿来照明用的。可这些珠子大多只能亮个一两天，就不再亮了。”所以不知不觉囤了一堆。
en_us: "Oh, I found these when I captured those animal demons and collected them because they glowed." Shen Ying continued to explain, "I don't have lights over here, so I thought I could use them to illuminate my house. But these pearls only lasted about one or two days before they lost their glow." Hence, she had unknowingly hoarded a heap of them.

source: “哦，那不要。”
en_us: "Oh, then I don't want you."
